#подключение необходимых библиотек
from itertools import product
import numpy as np
import time
import pandas as pd

#функция для генерации таблицы (матрицы) возможных стояний системы, состояния кодируются бинарным вектором. Размерность вектора равна количеству экологических ниш.
#значение вектора равно 1 - экологическая ниша занята, 0 - экологическая ниша свободна
#вектора обедняться в массив, размерность массива равна количеству возможных стояний системы
#входной параметр fn_niches - количество экологических ниш в системе
def state_matrix(fn_niches):
  c_matrix=[list(comb) for comb in product([0, 1], repeat=fn_niches)] #генерация массива векторов состояний системы
  c_matrix=np.array(c_matrix)
  c_matrix=np.delete(c_matrix, 0, axis=0) #удаление вектора с нулевыми значения - состояния когда виды в системе отсутствуют
  return c_matrix
 
#функция для  вывода на экран таблицы (матрицы) возможных состояний системы
#параметр fmatrix - массив с векторами, кодирующими состояний системы
def print_matrix(fmatrix):
  for row in fmatrix:
       print(row)


#функция для вывода информации по количеству стояний с n_occupied (n занятыми) экологическими нишами
#параметр fmatrix - массив с векторами, кодирующими состояний системы
#входной параметр fn_niches - количество экологических ниш в системе
def print_niches(fmatrix, fn_niches):
  row_sums = [sum(row) for row in fmatrix] #расчет количества занятых экологических ниш в каждом состоянии
  for i in range(0, fn_niches+1):
    number_occupied_ecological_niches=i
    number_of_states = row_sums.count(number_occupied_ecological_niches)
    print("\количество состояний с ", number_occupied_ecological_niches, " занятыми нишами => ", number_of_states)

#функция для оценки возможности перехода между стояниями в системе, если переход возможен, функция выдает значение 1 если не возможен, выдает значение 0
#параметр fmatrix - массив с векторами, кодирующими состояний системы
#параметр fR_sos - числовой вектор, содержащий информацию о количестве занятых экологических ниш в каждом состоянии
#параметр n1 -  номер состояния из которого оценивается возможность перехода
#параметр n2 -  номер состояния в которое оцениваться возможность перехода
def prob_transition(fmatrix, fR_sos, n1, n2):
  mismatches = np.sum(fmatrix[n1] != fmatrix[n2])
  if(mismatches==1 and fR_sos[n1]<fR_sos[n2]):
    return 1
  return 0

#функция для генерации квадратной матрицы разращенных переходов между состоянии, значение 0 в матрице переход между стояниями i и j запрещен, значение 1 - переход разрешен
#строки и столбцы в матрице - номера стояний
#параметр fmatrix - массив с векторами, кодирующими состояний системы
#параметр fR_sos - числовой вектор, содержащий информацию о количестве занятых экологических ниш в каждом состоянии
def pb_transition(fmatrix, fR_sos):
  ns=len(fmatrix)
  pp_matrix = np.zeros((ns, ns), dtype=int)
  for i in range(0, ns):
    for j in range(0, ns):
      pp_matrix[i,j]=prob_transition(fmatrix, fR_sos, i, j)
  return pp_matrix #выходная матрица разращенных переходов

#функция для оценки мгновенной вероятности перехода в стояния k из других состояния
#параметр fpp_matrix - матрица разращенных переходов
#параметр fPs - вектор текущие значения вероятностей нахождения системы в каждом из состояний 
def poz_cum_prob_transition(fpp_matrix, fPs, k):
  mask = (fpp_matrix[:, k] == 1)  # маска истинности
  mask[k] = False                 # исключаем k
  return np.sum(fPs[mask])        # суммируем вероятности по маске
 
#функция для оценки мгновенной вероятности перехода из состояния k в другие состояния
#параметр fpp_matrix - матрица разращенных переходов
#параметр fPs - вектор текущие значения вероятностей нахождения системы в каждом из состояний 
def neg_cum_prob_transition(fpp_matrix, fPs, k):
  mask = (fpp_matrix[k, :] == 1)  # маска истинности
  mask[k] = False                 # исключаем k
  return np.sum(mask)*fPs[k]      # суммируем вероятности по маске
  
#функция для интегрирования методом Эйлера с пересчетом с оценкой вероятности поглощенного состояния от времени
#входной параметр n_niches - количество экологических ниш в системе
#входной параметр Lp - вероятность видовой дивергенции
#входной параметр dt - значение временного шага для метода Эйлера с пересчетом
def integrate_eil_per(n_niches, Lp, dt):

    #старт алгоритма интегрирования
    st_matrix = state_matrix(n_niches) #генерируем матрицу стояний системы
    n_state=len(st_matrix) #количество стояний в системе
    print(f"\nвсего сотояний сисеты=> {len(st_matrix)}")
    R_sos = np.array([sum(row) for row in st_matrix]) #вектор количества занятых ниш в стоянии
    print_niches(st_matrix, n_niches) #выводим информацию к количестве состояний, соответствующих занятым нишам

    pp_matrix=pb_transition(st_matrix, R_sos) #генерируем матрицы возможных переходов
    print(f"\nразмерность матрицы разрещенных переходов=> {len(pp_matrix)}")   


    Ps=np.zeros(n_state) #инициализация массива вероятностей стояний
    Psp=np.zeros(n_state) #инициализация массива вероятностей стояний для промежуточного массива в алгоритме интегрирования методом Эйлера с пересчетом
    Psp2=np.zeros(n_state) #инициализация массива вероятностей стояний для промежуточного массива в интегрирования
    f1=np.zeros(n_state) #инициализация переменной массива для хранения промежуточного значения производной (правых частей уравнения)  для метода Эйлера с пересчетом
    
    Ps[0]=1 #задание начального условия - невероятность одного из стояний с одним видом равна 1
    
    
    #формирования таблицы данных datafreme для хранения времени шага, вероятности нахождения системы в стояниях с num занятыми нишами и вероятности поглощенного состояния
    df_pvale = pd.DataFrame(columns=range(1+n_niches)).astype(float) #таблицы для хранения времени шага - первая колонка и вероятности нахождения системы в стояниях с num занятыми нишами и вероятности поглощенного состояния
    col_num=np.array(range(1, n_niches+1)) #имена столбцов - идентификаторов информации о количестве занятых ниш
    col_num="num_"+col_num.astype(str)
    df_pvale.columns = np.append("time", col_num)  #имена столбцов - идентификатор столбца времени и информации о количестве занятых ниш
    df_pvale.loc[len(df_pvale)] = np.zeros(n_niches+1)
    df_pvale.iloc[0,1]=1 #добавление информации, что в начальные момент времени 0 в системе в вероятностью 1 был один вид
    
    t_start=int(time.time()) #стартовое время начала расчета в секундах для контроля производительности
    
    time_step=0 #задание стартового времени в интегрируемой системе
    while Ps[n_state-1] <=0.99: #правило отставники интегрирования, интегрирования останавливаться, если вероятность поглощенного стояния <=0.99
        
      time_step+=dt #увеличение текущего времени на шаг dt
      
      #первое действие для метода Эйлера с пересчетом, вычисление промежуточного значения производной и промежуточного значения функции
      for j in range(0, len(Ps)):
        poz=poz_cum_prob_transition(pp_matrix, Ps, j)
        neg=neg_cum_prob_transition(pp_matrix, Ps, j)
        f1[j]=Lp*(poz-neg) #промежуточное значение производной
        Psp2[j]=Ps[j]+f1[j]*dt #промежуточное значение функции
        
      #второе действие для метода Эйлера с пересчетом, вычисление окончательного значения функции
      for j in range(0, len(Ps)):
        poz=poz_cum_prob_transition(pp_matrix, Psp2, j)
        neg=neg_cum_prob_transition(pp_matrix, Psp2, j)
        Psp[j]=Ps[j]+(f1[j]+Lp*(poz-neg))*(dt/2) #конечное значение функции по усредненному значению производной на шаге интегрирование
      
      #перерисовывание значений
      Ps=Psp.copy()
      
      #добавление данных в результирующий datafreme
      pv_vector=np.zeros(n_niches+1)
      pv_vector[0]=np.round(time_step, decimals=3)
      
      #расчет вероятностей нахождения системы в состояниях с j занятыми экологическими нишами
      for j in range(1, n_niches+1):
        indices = np.where(R_sos == j) #индексы элементов в стояний в которых j ниш занято
        pv_vector[j]=sum(Ps[indices])  #извлечение вероятностей стояний в которых j ниш занято и суммированные этих вероятностей 
      df_pvale.loc[len(df_pvale)] = pv_vector
      
      #вывод на экран текущей вероятности поглощенного состояния
      if len(df_pvale) % 100 == 0:
        print("\n", "кол-во_ниш=>", n_niches, " time=> ", np.round(time_step, decimals=3), " p_value=> ", np.round(Ps[n_state-1], decimals=4))
    
    t_final=int(time.time()) #время окончания расчета в секундах
    print(f"\nвремя расчета=> {t_final-t_start}\n") #вывод времени, затраченного на расчет на экран
    
    return df_pvale #вывод результата - таблицы данных datafreme с временем шага, вероятностью нахождения системы в стояниях с num занятыми нишами и вероятности поглощенного состояния

#начало работы алгоритма


path="path_to_directories_for_saving_calculation_result"

Lpm=np.arange(0.01, 0.21, 0.01) #задаем вектор  значений вероятностей занятие новой ниши (вероятности видовой дивергенции) в единицу времени
dt=0.1 #задаем шаг интегрирования для метода Эйлера с пересчетом

#запуск алгоритм исследования системы с анализом для вех комбинаций вероятностей переходов Lpm и количества экологических ниш, меняющихся в диапазоне от 2 до 15
for i in range(0, len(Lpm)): #внешний цикл перебора вероятностей
  for j in range(2, 16): #внутренний цикл перебора количества экологических ниш
    n_niches=j #задание значение для параметра количества экологических ниш
    Lp=Lpm[i] #задание значение для параметра вероятностей видовой дивергенции
    df_pvalue=integrate_eil_per(n_niches, Lp, dt) #запуск интегрирования
    st_file=f"{path}rez_Lp-{np.round(Lp, decimals=2)}_Nniches-{n_niches}.tsv" 
    df_pvalue.to_csv(st_file, sep='\t', index=False, encoding='utf-8') #запасись таблицы с временем шага и вероятностями на диск в директорию path, имя файла содержит знание вероятности видовой дивергенции и количества экологических ниш в системе

